nodeiot/remoteIO-esp8266/src/ESP8266RemoteIO.cpp
/*
######################################################################
##      Integração das tecnologias da REMOTE IO com Node IOT        ##
##                          Version 1.0                             ##
##   Código base para implementação de projetos de digitalização de ##
##   processos, automação, coleta de dados e envio de comandos com  ##
##   controle embarcado e na nuvem.                                 ##
##                                                                  ##
######################################################################
*/

#include "ESP8266RemoteIO.h";
#include "index_html.h";

RemoteIO::RemoteIO()
{
  _appPort = 5000;

  server = new AsyncWebServer(80);

  anchor_route = "http://anchor_IP/post-message";
  anchored_route = "http://anchored_IP/post-message";

  state = "";
  token = "";
    
  configurations = configurationDocument.to<JsonArray>();
  setIO = configurations.createNestedObject();

  Connected = false;
  Socketed = 0;
  messageTimestamp = 0;

  connection_state = INICIALIZATION;
  next_state = INICIALIZATION;

  start_debounce_time = 0;
  start_browsing_time = 0;
  start_reconnect_time = 0;
  start_reset_time = 0;

  lastIP_index = -1;
  anchored = false;
  anchoring = false;
}

void RemoteIO::begin()
{
  Serial.begin(115200);

  if (!SPIFFS.begin()) 
  {
    //Serial.println("Erro ao montar o sistema de arquivos");
    ESP.restart();
  }

  StaticJsonDocument<JSON_DOCUMENT_CAPACITY> nvsDoc;
  bool hasConfig = true;

  File file = SPIFFS.open("/config.json", "r");

  if (!file) 
  {
    //Serial.println("\nnão achei o config.json");
    hasConfig = false;
  }
  else 
  {
    //Serial.println("\nachei o config.json");
    deserializeJson(nvsDoc, file);
  }
  
  file.close();

  String NVS_SSID = nvsDoc["ssid"].as<String>();
  String NVS_PASSWORD = nvsDoc["password"].as<String>();
  String NVS_COMPANYNAME = nvsDoc["companyName"].as<String>();
  String NVS_DEVICEID = nvsDoc["deviceId"].as<String>();
  String NVS_MODEL = nvsDoc["model"].as<String>();
  String NVS_IOSETTINGS = nvsDoc["ioSettings"].as<String>();
  bool NVS_SSIDAUTH = nvsDoc["ssidAuth"].as<bool>();

  if (!hasConfig)
  {
    startAccessPoint();
  }
  else
  {
    _ssid = NVS_SSID;
    _password = NVS_PASSWORD;
    _companyName = NVS_COMPANYNAME;
    _deviceId = NVS_DEVICEID;
    _model = NVS_MODEL;
    ssidAuth = NVS_SSIDAUTH;

    appBaseUrl = "https://api.nodeiot.app.br/api";
    appVerifyUrl = appBaseUrl + "/devices/verify";
    appPostData = appBaseUrl + "/broker/data/";
    appSideDoor = appBaseUrl + "/devices/devicedisconnected";
    appPostDataFromAnchored = appBaseUrl + "/broker/ahamdata";
    appLastDataUrl = appBaseUrl + "/devices/getdata/" + _companyName + "/" + _deviceId;

    nodeIotConnection();

    String LOCAL_DOMAIN = String("niot-") + String(_deviceId);

    if (!MDNS.begin(LOCAL_DOMAIN)) 
    {
      //Serial.println("Erro ao configurar o mDNS");
    }

    AsyncCallbackJsonWebHandler* handler = new AsyncCallbackJsonWebHandler("/post-message", [this](AsyncWebServerRequest *request, JsonVariant &json) {
      StaticJsonDocument<250> data;
      String response;
      if (json.is<JsonArray>())
      {
        data = json.as<JsonArray>();
      }
      else if (json.is<JsonObject>())
      {
        data = json.as<JsonObject>();
      }
      
      //Serial.print("[AsyncCallback]: ");
      //Serial.println(data.as<String>());

      
      if (data.containsKey("status"))
      {
        if (connection_state == CONNECTED)
        {
          data.remove("status");
          data["ipAddress"] = request->client()->remoteIP().toString();

          serializeJson(data, send_to_niot_buffer);

          if (espPOST(appSideDoor, "", send_to_niot_buffer) == HTTP_CODE_OK)
          {
            send_to_niot_buffer.clear();
            data.clear();
            
            if (anchoring) 
            {
              data["msg"] = "ok";
              anchoring = false;
            }
            else data["msg"] = "received";

            serializeJson(data, response);
            request->send(200, "application/json", response);
          }
          else 
          {
            send_to_niot_buffer.clear();
            data.clear();
            data["msg"] = "post to niot failed";
            serializeJson(data, response);
            request->send(500, "application/json", response);
          }
        }
        else 
        {
          if (request->client()->remoteIP().toString() == anchor_IP) 
          {
            anchor_IP.clear();
            anchored = false;
          }

          data.clear();
          data["msg"] = "disconnected";
          serializeJson(data, response);
          request->send(500, "application/json", response);
        }
      }
      
      else if (data.containsKey("ref") && !data.containsKey("deviceId") && connection_state == DISCONNECTED)
      {
        anchor_IP.clear();
        anchor_IP = request->client()->remoteIP().toString();
        anchored = true;
        
        String ref = data["ref"].as<String>();
        setIO[ref]["value"] = data["value"];
        
        if (setIO[ref]["Mode"] == "OUTPUT")
        {
          updatePinOutput(ref);
        }

        data.clear();
        data["msg"] = "ok";
        serializeJson(data, response);
        request->send(200, "application/json", response);

        if (ref == "restart") ESP.restart();
        else if (ref == "reset")
        {
          if (SPIFFS.remove("/config.json")) Serial.println("/config.json removido com sucesso!");
          else Serial.println("Falha ao remover /config.json");
          delay(1000);
          ESP.restart();
        }
      }
      
      else if (data.containsKey("deviceId"))
      {
        if (connection_state == CONNECTED)
        {
          serializeJson(data, send_to_niot_buffer);
          if (espPOST(appPostDataFromAnchored, "", send_to_niot_buffer) == HTTP_CODE_OK)
          {
            send_to_niot_buffer.clear();
            data.clear();
            data["msg"] = "ok";
            serializeJson(data, response);
            request->send(200, "application/json", response);
          }
          else 
          {
            send_to_niot_buffer.clear();
            data.clear();
            data["msg"] = "post to niot failed";
            serializeJson(data, response);
            request->send(500, "application/json", response);
          }
        }
        else 
        {
          data.clear();
          data["msg"] = "disconnected";
          serializeJson(data, response);
          request->send(500, "application/json", response);
        }
      }
      else 
      {
        data.clear();
        data["msg"] = "unhandled message";
        serializeJson(data, response);
        request->send(500, "application/json", response);
      }
    });
    server->addHandler(handler);
  }

  server->on("/monitor", HTTP_GET, [this](AsyncWebServerRequest *request) {
      
      request->send_P(200, "text/html", page_monitor);
  });

