nodeiot/remoteIO-esp8266/src/ESP8266RemoteIO.cpp
  server->on("/monitor-reset", HTTP_GET, [this](AsyncWebServerRequest *request) {
      
      if (SPIFFS.remove("/config.json")) //Serial.println("/config.json removido com sucesso!");
      //else //Serial.println("Falha ao remover /config.json");
      request->send(200, "text/plain", "Reset de credenciais efetuado com sucesso! Reiniciando dispositivo...");
      delay(1000);
      ESP.restart();
  });

  server->on("/monitor-data", HTTP_GET, [this](AsyncWebServerRequest *request) {

      String wifi_state; 
      
      if (WiFi.status() == WL_CONNECTED) wifi_state = "Conectado";
      else wifi_state = "Desconectado";
      
      if (state == "accepted") monitor_doc["NodeIoT"]["authentication"] = "Verificado";
      else monitor_doc["NodeIoT"]["authentication"] = "Não verificado";

      if (Connected) monitor_doc["NodeIoT"]["connection"] = "Conectado";
      else monitor_doc["NodeIoT"]["connection"] = "Desconectado";

      monitor_doc["Wi-Fi"]["ssid"] = _ssid;
      monitor_doc["Wi-Fi"]["ipLocal"] = WiFi.localIP().toString();
      monitor_doc["Wi-Fi"]["state"] = wifi_state;
      monitor_doc["Wi-Fi"]["rssi"] = WiFi.RSSI();
      monitor_doc["RemoteIO"]["model"] = _model;
      monitor_doc["RemoteIO"]["memory"] = String((ESP.getFlashChipRealSize() / 1024));
      monitor_doc["NodeIoT"]["companyName"] = _companyName;
      monitor_doc["NodeIoT"]["deviceId"] = _deviceId;

      String monitor_info;
      serializeJson(monitor_doc, monitor_info);
      monitor_doc.clear();
      
      request->send(200, "application/json", monitor_info);
  });
  server->onNotFound(std::bind(&RemoteIO::notFound, this, std::placeholders::_1));

  MDNS.addService("http", "tcp", 80);
  
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");

  ArduinoOTA.begin();
  server->begin();
}

void RemoteIO::checkResetting(long timeInterval)
{
  if (digitalRead(setIO["reset"]["pin"].as<int>()) == LOW)
  {
    if (start_reset_time == 0) start_reset_time = millis();
    else if (millis() - start_reset_time >= timeInterval)
    {
      if (SPIFFS.remove("/config.json")) //Serial.println("/config.json removido com sucesso!");
      //else //Serial.println("Falha ao remover /config.json");
      delay(1000);
      ESP.restart();
    }
  }
  else start_reset_time = 0;
}

void RemoteIO::startAccessPoint()
{
  File model_file = SPIFFS.open("/model.json", "r");
  StaticJsonDocument<100> model_doc;
  deserializeJson(model_doc, model_file);
  model_file.close();
  _model = model_doc["model"].as<String>();
  //Serial.println(_model);
  model_doc.clear();

  WiFi.disconnect(true);
  WiFi.mode(WIFI_AP_STA);

  IPAddress apIP(192, 168, 4, 1);

  bool result = WiFi.softAP("RemoteIO");
  if (!result) 
  {
    //Serial.println("Erro ao configurar o ponto de acesso");
    ESP.restart();
  }
  
  WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
  
  Serial.println("Ponto de acesso iniciado");

  IPAddress IP = WiFi.softAPIP();
  //Serial.print("IP do ponto de acesso: ");
  //Serial.println(IP);

  String LOCAL_DOMAIN = String("remoteio");

  if (!MDNS.begin(LOCAL_DOMAIN)) 
  {
    //Serial.println("Erro ao configurar o mDNS");
  }

  server->on("/", HTTP_GET, [this](AsyncWebServerRequest *request) {
      request->send_P(200, "text/html", page_setup);
  });

  server->on("/get", HTTP_GET, [this](AsyncWebServerRequest *request) {

    if (request->hasParam("ssid") && request->hasParam("password") && request->hasParam("companyName") && request->hasParam("deviceId")) 
    {
      String arg_ssid = request->getParam("ssid")->value();
      String arg_password = request->getParam("password")->value();
      String arg_companyName = request->getParam("companyName")->value();
      String arg_deviceId = request->getParam("deviceId")->value();

      StaticJsonDocument<400> doc;
      doc["ssid"] = arg_ssid;
      doc["password"] = arg_password;
      doc["companyName"] = arg_companyName;
      doc["deviceId"] = arg_deviceId;
      doc["model"] = _model;
      doc["ssidAuth"] = false;

      File file = SPIFFS.open("/config.json", "w");
      serializeJson(doc, file);
      file.close();
      doc.clear();

      request->send(200, "text/plain", "Credenciais recebidas com sucesso. Tentando conexão...");
      delay(1000); 
      ESP.restart();
    }
    else 
    {
      request->send(400, "text/plain", "Parâmetros ausentes");
    }
  });
}

void RemoteIO::loop()
{
  ArduinoOTA.handle();
  switchState();
  stateLogic();
  checkResetting(5000); 
}

void RemoteIO::browseService(const char * service, const char * proto)
{
  int n = MDNS.queryService(service, proto);
  if (n == 0) 
  {
    lastIP_index = -1;
  } 
  else 
  {
    for (int i = 0; i < n; i++) 
    {
      if ((MDNS.hostname(i).indexOf("niot") != -1) || (MDNS.hostname(i).indexOf("esp32") != -1) || (MDNS.hostname(i).indexOf("esp8266") != -1))
      {
        if (i > lastIP_index)
        {
          lastIP_index = i;
          anchor_IP = MDNS.IP(i).toString();
          return;
        }
        else lastIP_index = -1;
      }
    }
  }
}

void RemoteIO::switchState()
{
  switch (connection_state)
  {
    case INICIALIZATION:
      if ((WiFi.status() == WL_CONNECTED) && (Connected == true))
      {
        //Serial.println("[INICIALIZATION] vai pro CONNECTED");
        next_state = CONNECTED;
      }
      else
      {
        next_state = INICIALIZATION;
      }
      break;
      
    case CONNECTED:
      if (WiFi.status() != WL_CONNECTED)
      {
        //Serial.println("[CONNECTED] vai pro NO_WIFI");
        next_state = NO_WIFI;
      }
      else if (!Connected)
      {
        //Serial.println("[CONNECTED] vai pro DISCONNECTED");
        next_state = DISCONNECTED;
      }
      else 
      {
        next_state = CONNECTED;
      }
      break;
      
    case NO_WIFI:
      if (WiFi.status() == WL_CONNECTED)
      {
        //Serial.println("[NO_WIFI] vai pro DISCONNECTED");
        start_debounce_time = 0;
        next_state = DISCONNECTED;
      }
      else 
      {
        next_state = NO_WIFI;
      }
      break;
      
    case DISCONNECTED:
      if (Connected)
      {
        //Serial.println("[DISCONNECTED] vai pro CONNECTED");
        next_state = CONNECTED;
      }
      else if (WiFi.status() != WL_CONNECTED)
      {
        //Serial.println("[DISCONNECTED] vai pro NO_WIFI");  
        next_state = NO_WIFI;
      }
      else 
      {
        next_state = DISCONNECTED;
      }
      break;
  }
  connection_state = next_state;
}

