nodeiot/remoteIO-esp8266/src/ESP8266RemoteIO.cpp
void RemoteIO::stateLogic()
{
  switch (connection_state)
  {
    case INICIALIZATION:
      
      socketIO.loop(); 
      if (Connected == false)
      {
        socketIOConnect();
      }
      break;
      
    case CONNECTED:
      
      socketIO.loop();
      if (setIO["disconnect"]["value"] == "1")
      {
        socketIO.sendEVENT("disconnect");
      }

      break;
      
    case NO_WIFI:

      if (millis() - start_reconnect_time >= 10000)
      {
        start_reconnect_time = millis();
        start_debounce_time = millis();
        nodeIotConnection(); 
      }
      break;

    case DISCONNECTED:
      
      if (setIO["disconnect"]["value"] == "0")
      {
        socketIO.loop();
        socketIOConnect();
      }
      
      if ((!anchored) && (millis() - start_browsing_time >= 5000))
      {
        browseService("http", "tcp");
        start_browsing_time = millis();

        if (anchor_IP.length() > 0)
        {
          StaticJsonDocument<250> doc;
          doc["status"] = "disconnected";
          doc["mac"] = WiFi.macAddress();
          send_to_anchor_buffer.clear();
          serializeJson(doc, send_to_anchor_buffer);
          doc.clear();

          espPOST(anchor_route, "", send_to_anchor_buffer);          
        }
      }
      
      if (millis() - start_reconnect_time >= 60000)
      {
        start_reconnect_time = millis();
        start_debounce_time = millis();
        nodeIotConnection(); 
      }
      break;
  }
}

void RemoteIO::socketIOEvent(socketIOmessageType_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case sIOtype_DISCONNECT:
    //Serial.printf("[IOc] Disconnected!\n");
    Connected = false;
    break;
  case sIOtype_CONNECT:
    //Serial.printf("[IOc] Connected to url: %s\n", payload);
    socketIO.send(sIOtype_CONNECT, "/");
    break;
  case sIOtype_EVENT:
  {
    char *sptr = NULL;
    int id = strtol((char *)payload, &sptr, 10);

    //Serial.printf("[IOc] get event: %s id: %d\n", payload, id);
    
    if (id)
    {
      payload = (uint8_t *)sptr;
    }

    StaticJsonDocument<1024> doc;
    StaticJsonDocument<250> doc2;
    DeserializationError error = deserializeJson(doc, payload, length);

    if (error)
    {
      //Serial.print(F("[IOc]: deserializeJson() failed: "));
      //Serial.println(error.c_str());
      return;
    }

    String eventName = doc[0];

    //Serial.printf("[IOc] event name: %s\n", eventName.c_str());

    if (doc[1].containsKey("ipdest")) 
    {
      doc2["ref"] = doc[1]["ref"];
      doc2["value"] = doc[1]["value"];
      
      anchored_IP = doc[1]["ipdest"].as<String>();
      serializeJson(doc2, send_to_anchored_buffer);
      
      doc2.clear();
      
      espPOST(anchored_route, "", send_to_anchored_buffer);
      send_to_anchored_buffer.clear();
    }
    else 
    {
      String ref = doc[1]["ref"];
      String value = doc[1]["value"];

      if (ref == "restart") ESP.restart();
      else if (ref == "reset")
      {
        if (SPIFFS.remove("/config.json")) //Serial.println("/config.json removido com sucesso!");
        //else //Serial.println("Falha ao remover /config.json");
        delay(1000);
        ESP.restart();
      }

      setIO[ref]["value"] = value;

      if (setIO[ref]["Mode"] == "OUTPUT")
      {
        updatePinOutput(ref);
      }
    }
    doc.clear();
  }
  break;
  case sIOtype_ACK:
    //Serial.printf("[IOc] get ack: %u\n", length);
    break;
  case sIOtype_ERROR:
    //Serial.printf("[IOc] get error: %u\n", length);
    break;
  case sIOtype_BINARY_EVENT:
    //Serial.printf("[IOc] get binary: %u\n", length);
    break;
  case sIOtype_BINARY_ACK:
    //Serial.printf("[IOc] get binary ack: %u\n", length);
    break;
  }
}

void RemoteIO::nodeIotConnection()
{
  WiFi.disconnect(true);
  Connected = false;
  WiFi.mode(WIFI_STA);
  String hostname = String("niot-") + String(_deviceId);
  WiFi.setHostname(hostname.c_str());
  WiFi.begin(_ssid, _password);

  WiFi.waitForConnectResult();

  long wifi_conn_time = 0;

  if (!ssidAuth) 
  {
    wifi_conn_time = millis();
  }

  while (WiFi.status() != WL_CONNECTED)
  {
    //Serial.print(".");
    delay(500);
    if ((wifi_conn_time > 0) && (millis() - wifi_conn_time >= 5000))
    {
      //Serial.println("deu 5 segundos");
      if (SPIFFS.remove("/config.json")) 
      {
        //Serial.println("/config.json removido com sucesso!");
        delay(1000);
        ESP.restart();
      }
      //else Serial.println("Falha ao remover /config.json");
    }
    if ((start_debounce_time != 0) && (millis() - start_debounce_time >= 2000))
    {
      WiFi.disconnect();
      //Serial.println("[niotConnection] wifi.disconnect(), return");
      return;
    }
  }

  if (!ssidAuth) 
  {
    File file = SPIFFS.open("/config.json", "r");
    StaticJsonDocument<512> nvsDoc;
    deserializeJson(nvsDoc, file);
    file.close();
    nvsDoc["ssidAuth"] = true;
    if (SPIFFS.remove("/config.json")) //Serial.println("atualizando spiffs, /config.json removido com sucesso!");
    file = SPIFFS.open("/config.json", "w");
    serializeJson(nvsDoc, file);
    nvsDoc.clear();
    file.close();
  }

  //Serial.printf("[nodeIotConnection] WiFi Connected %s\n", WiFi.localIP().toString().c_str());

  appVerifyUrl.replace(" ", "%20");
  appLastDataUrl.replace(" ", "%20");
  
  while (state != "accepted")
  {
    if ((start_debounce_time != 0) && (millis() - start_debounce_time >= 2000))
    {
      return;
    }
    tryAuthenticate();
  }
  
  String appSocketPath = "/socket.io/?token=" + token + "&EIO=4";

  fetchLatestData();

  socketIO.begin(_appHost, _appPort, appSocketPath); 
  socketIO.onEvent(std::bind(&RemoteIO::socketIOEvent, this, std::placeholders::_1, std::placeholders::_2, std::placeholders::_3));
}

